In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'one':pd.Series([1,2,3],index=['a','b','c']), 'two':pd.Series([1,2,3,4],index=['b','a','c','d'])})
df

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [4]:
df.mean() # 默认按列求平均

one    2.0
two    2.5
dtype: float64

In [5]:
df.mean(axis=1) # 按行求平均

a    1.5
b    1.5
c    3.0
d    4.0
dtype: float64

In [6]:
df.sum()

one     6.0
two    10.0
dtype: float64

In [7]:
df.sum(axis=1)

a    3.0
b    3.0
c    6.0
d    4.0
dtype: float64

In [10]:
df.sort_index()

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

In [11]:
df.sort_values(by='two')

   one  two
b  2.0    1
a  1.0    2
c  3.0    3
d  NaN    4

In [12]:
df.sort_values(by='two', ascending=False) # 倒序

   one  two
d  NaN    4
c  3.0    3
a  1.0    2
b  2.0    1

In [15]:
df.sort_values(by='d', axis=1)

   two  one
a    2  1.0
b    1  2.0
c    3  3.0
d    4  NaN